; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	infrared2 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	image3 - mode
	Star0 - direction
	GroundStation4 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 infrared2)
	(supports instrument2 image3)
	(calibration_target instrument2 Star1)
	(supports instrument3 image3)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 image3)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image3)
	(supports instrument5 spectrograph1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
)
(:goal (and
	(pointing satellite1 Star7)
	(have_image Star5 spectrograph0)
	(have_image Phenomenon6 spectrograph1)
	(have_image Star7 infrared2)
	(have_image Planet8 image3)
))

)

; plan
1. (turn_to satellite2 groundstation3 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 5
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 5
3. (calibrate satellite2 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 0 of 5
4. (turn_to satellite2 planet8 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet8)
   goals met: 0 of 5
5. (take_image satellite2 planet8 instrument5 image3)
   added: (have_image planet8 image3)
   goals met: 1 of 5
6. (turn_to satellite2 phenomenon6 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon6)
   goals met: 1 of 5
7. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 5
8. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 1 of 5
9. (take_image satellite2 phenomenon6 instrument5 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 2 of 5
10. (turn_to satellite1 star7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star7)
   goals met: 3 of 5
11. (take_image satellite1 star7 instrument3 infrared2)
   added: (have_image star7 infrared2)
   goals met: 4 of 5
12. (turn_to satellite2 star5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star5)
   goals met: 4 of 5
13. (take_image satellite2 star5 instrument5 spectrograph0)
   added: (have_image star5 spectrograph0)
   goals met: 5 of 5
